const question = document.querySelector('#question');
const progressText = document.querySelector('#progress-text');
const choices = Array.from(document.querySelectorAll('.choice-text'))
const scoreText = document.querySelector('#score');
const answers = document.getElementById("answer-sheet");

let currentQuestion = {};
let availableQuestion = [];
let score = 0;
let acceptingAnswer = true;
let questionCounter = 0;


let questions = [
    {
        question:"மகேந்திரவர்ம பல்லவனின் 'தட்சிணசித்திரம்'  எவ்வகை நூல்", 
        choice1:"வரலாற்று நூல்",
        choice2:"ஓவியநூல்",
        choice3:"நாட்டியநூல்",
        choice4:"நாடகநூல்",
       
       answer:2
     },
     
     {
        question:"இறையருள் பெற்த திருக்குழந்தை எனப் பாராட்டப் பெற்வைர்",
        choice1:"மாணிக்கவாசகர்",
        choice2: "திருநாவுக்கரசர்",
        choice3:"ராமலிங்க அடிகளார்",
        choice4:"தாயுமானவர்",
        
        answer:3
        },
        
        
        
        {
        question:"ஒவ்வொரு செய்தியாளரும் னைக்கென ஒதுக்கப்பட்ட இடங்களுக்கோ அலுவலகங்களுக்கோ நாள்தோறும் சென்று செய்திகளை திரட்டுவார் இதனை எவ்வாறு குறிப்பிடுவர்",
        choice1:"துப்பறிதல்",
        choice2:"செய்திகளம்", 
        choice3:"செய்தியின் மூலம்", 
        choice4:"செய்திகளை திரட்டும் இடம்", 
        
        answer:2
        },
        
        
        {
        question:"முதன் முதலில் நடத்தப்பட்ட தேசிய சமுதாய நாடகம்",
        choice1:"கதரின் வெற்றி" ,
        choice2:"டம்பாச்சாரி விலாசம்", 
        choice3:"பவளக்கொடி",
        choice4:"நந்தனார் சரித்திரம்", 
        
        answer:1
        },
        
        {
        question:"நாடகம் ஏத்தும் கணிகை என்று இளங்கோ அடிகள் சிலப்பதிகாரத்தில் யாரை குறிப்பிடுகிறார்?",
        choice1:"மணிமேகலை",
        choice2:"மாதவி",
        choice3:"கண்ணகி", 
        choice4:"சுமைதி",
        
        answer:2
        },
        
        
        {
        question:"வீரமாமுனிவர் தமிழ் முனிவர்களுள் ஒருவராக விளங்குகின்றார் என்று கூறியவர்",
        choice1:"ரா பி சேதுப்பிள்ளை",
        choice2:"குணங்குடி மஸ்றான் சாகிபு", 
        choice3:"ஆறுமுக நாவலர்",
        choice4:"பரிதிமாற்கலைஞர்", 
        
        answer:1
        },
        {
           question:"ஆபுத்திரன் நாடு அடைந்த காதை மணிமேகலையில் எத்தனாவது காதை",
           choice1:"பன்னிரண்டாவது",
           choice2:"இருபத்தி நான்காவது காதை",
           choice3:"பதினான்காவது காதை",
           choice4:"இருபறாவது காதை",
           
           answer:2
        },
           
        {
           question:"பாட்டாளி மக்களின் பசி தீர வேண்டும் பணமென்ற மோகத்தின் விசை தீர வேண்டும் என்று முழங்கிய கவிஞர் யார்?",
           choice1:"கவிமணி",
           choice2:"நாமக்கல் கவிஞர்", 
           choice3:"முடியரசன்",
           choice4:"சுரதா",
           
           answer:2
           },
           
           
           {
           question:"பசிப்பிணி என்னும் பாவி என்று பசியின் கொடுமையை கூறும் காப்பியம்", 
           choice1:"யசோரை காவியம்" ,
           choice2:"மணிகமகலை",
           choice3:"சிலப்பதிகாரம்",
           choice4:"குண்டலகேசி",
           
           answer:2
           },
           
           
           {
           question:"காய் முன் நிரை வருவது",
           choice1:"கலித்தளை",
           choice2:"வெண்சீர் வெண்டளை", 
           choice3:"இயற்சீர் வெண்டளை",
           choice4:"ஒன்றிய வஞ்சித்தளை", 
           
           answer:1
           },
           
           {
           question:"மென்று வேர்ச்சொல்லை அறிக",
           choice1:"மெல்",
           choice2:"மென்த", 
           choice3:"மென்றான்", 
           choice4:"மென்",
           
           answer:1
           },
           
           {
           question:"பொருந்தாத சொல்லை கண்டறிக", 
           choice1:"தேவாரம்",
           choice2:"திருவாசகம்", 
           choice3:"திருப்பாவை",
           choice4:"திருவெம்பாவை", 
           
           answer:1
           },
           
           
           {
           question:"உண் என்னும் வேர்ச்சொல்லின் வினை எச்சம்",
           choice1:"உண்டு",
           choice2:"உண்டான்", 
           choice3:"உண்டவர்",
           choice4:"உண்ணுதல்",
     
           answer:1
           },
           
           {
           question:"விரிகதிர் இலக்கணக்குறிப்பு தருக",
           choice1:"பண்புத் தொகை",
           choice2:"வினைத் தொகை", 
           choice3:"உவமைத் தொகை", 
           choice4:"உம்மைத் தொகை",
     
           answer:2
           },
           
           
           {
           question:"பொறு என்த வேர் சொல்லின் தொழிற்பெயர் என்ன",
           choice1:"பொறுத்தான்",
           choice2:"பொறுத்தல்",
           choice3:"பொறுக்கினான்", 
           choice4:"வெறுத்தான்",
           
           answer:2
           },
           
           {
           question:"பெரியபுராணம் எந்த திருமுறைக்கு உட்பட்டது",
           choice1:"12",
           choice2:"10",
           choice3:"9",
           choice4:"11", 
           
           answer:1
           },
     
           {
              question:"தமிழே மிகவும் பண்பட்ட மொழி அது தனக்கென உரிய இலக்கியச் செல்வங்களைப் பெற்றிருக்கும் மொழி என்று கூறியவர் யார்",
              choice1:"கெல்லட்",
              choice2:"மாக்ஸ்முல்லர்", 
              choice3:"கமல்சுலபமில்",
              choice4:"கால்டுவெல்",
              
              answer:2
              },
              
              {
              question:"நீரின் வந்த நிமிர்பரிப் புரவியும் காலின் வந்த கருங்கறி மூடையும் என்த வரிகள் இடம்பெற்றுள்ள நூல் எது?",
              choice1:"மதுரைக்காஞ்சி",
              choice2:"புறநானூறு",
              choice3:"பதிற்றுப்பத்து", 
              choice4:"பட்டினப்பாலை",
              
              answer:4
              },
              
              {
              question:"செந்தமிழ் நாடெனும் போதினிலே இன்பத் தேன் வந்து பாயுது காதினிலே என்று பாடியவர் யார்?",
              choice1:"பாரதிதாசன்",
              choice2:"கம்பர்",
              choice3:"பாரதியார்", 
              choice4:"அவ்வையார்",
              
              answer:3
              },
              
              {
              question:"ரூபாவதி கலாவதி நாடகங்களின் ஆசிரியர் யார்?",
              choice1:"அயோத்திதாசர்",
              choice2:"பம்மல் சம்பந்தனார்", 
              choice3:"பரிதிமாற்கலைஞர்",
              choice4:"தேவனேயப்பாவாணர்",
              
              answer:3
              },
               
              {
              question:"பிரான்சிஸ் சென்கின்ஸ் என்பவர் எந்த ஆண்டு ரிச்மண்ட் என்னுமிடத்தில் பலரும் பார்க்கும் வகையில் இயக்கப் படத்தை வடிவமைத்தார்",
              choice1:"1862",
              choice2:"1864",
              choice3:"1831",
              choice4:"1894",
              answer:4
              },
              
              {
              question:"வீறுநடை செம்மொழி தமிழ்மொழி உலகம் வேரூன்றிய நாள்முதல் உயிர்மொழி என்று தமிழின் பெருமையை பறை சாற்றியவர் யார்?",
              choice1:"பெருஞ்சித்திரனார்",
              choice2:"பாவனார்",
              choice3:"பரிதிமாற்கலைஞர்", 
              choice4:"திரு வி க",
              
              answer:1
              },
              
              {
              question:"எந்த தீவில் தமிழர்கள் ஒப்பந்தக் கூலிகளாக குடியமர்த்தப்பட்டனர்",
              choice1:"பினாங்கு",
              choice2:"ரியூனியன்", 
              choice3:"பிஜி",
              choice4:"அந்தமான்",
              
              answer:2
              },
               
              {
              question:"ஞாயிறு வட்டம் என்று குறிப்பு காணப்படும் நூல்",
              choice1:"சிலப்பதிகாரம",
              choice2:"புறநானூறு",
              choice3:"சீவகசிதாமணி",
              choice4:"மணிமேகலை",
              
              answer:2
              },
              
              
              {
              question:"ஒரு நாட்டில் பிறந்த மக்களுக்கு வேண்டப்படும் பற்றுகளில் தலையாய பற்று மொழிப் பற்று என்று கூறியவர் யார்?",
              choice1:"காந்தியடிகள்",
              choice2:"ஈவே ராமசாமி", 
              choice3:"பரிதிமாற்கலைஞர்", 
              choice4:"பெருஞ்சித்திரனார்",
              
              answer:2
              },
              
              
              {
              question:"அசலாம்பிகை அம்மையார் பிறந்த ஊர் எது?", 
              choice1:"நல்லூர்",
              choice2:"விளாச்சேரி", 
              choice3:"முரம்பு",
              choice4:"இரட்டனை",
              
              answer:4
              },
              
              
              {
              question:"இழைகத்து அனைய தெருவம் இழைகத்து அனைத்கை அண்ணல் கோயில் என்த பாடல் இதில் இடம் பெற்றுள்ளது",
              choice1:"மணிமேகலை",
              choice2:"சீவகசிதாமணி", 
              choice3:"மதுரைக்காஞ்சி",
              choice4:"பரிபாடல்",
              
              answer:4
              },
              
              
              {
              question:"உவேசா பிறந்த ஊர் எது?",
              choice1:"உத்தமநாதபுரம்",
              choice2:"லட்சுமிபுரம்",
              choice3:"திருச்சி",
              choice4:"திருப்பூர்", 
              
              answer:1
              },
              
              {
                 question:"நோய்க்கு மருந்து இலக்கியம் என்று கூறியவர் யார்?",
                 choice1:"குமரகுருபரர்",
                 choice2:"மகாவித்துவான் மீனாட்சிசுந்ரைனார்",
                 choice3:"உ வே சாமிநாத ஐயர்",
                 choice4:"கம்பர்",
                 
                 answer:2
                 },
                 
                 
                 {
                 question:"மனித நாகரிகத் தொட்டில் என்று அழைக்கப்படுவது?",
                 choice1:"எகிப்து" ,
                 choice2:"லெமூரியா", 
                 choice3:"ஹரப்பா",
                 choice4:"சிந்து",
                 
                 answer:2
                 },
                 
                 
                 {
                 question:"பரிதிமாற்கலைஞர் வசன நடை கைவந்த வள்ளலார் என்று யாரை பாராட்டினார்?",
                 choice1:"ரா பி சேதுப்பிள்ளை",
                 choice2:"ஆறுமுகநாவலர்",
                 choice3:"மூ.வ",
                 choice4:"புதுமைப்பித்தன்", 
                 
                 answer:2
                 },
                 
                 
                 {
                 question:"இந்தியன் சஞ்சிகை, இந்தியாவின் தொல்பொருள் ஆய்வு முதலான ஏடுகளில் தமிழ் மொழி பற்றிய ஆராய்ச்சி கட்டுரைகளை ஆங்கிலத்தில் எழுதி வெளியிட்டவர் யார்?",
                 choice1:"கால்டுவெல்",
                 choice2:"வீரமாமுனிவர்", 
                 choice3:"ஜி யு போப்",
                 choice4:"தேவநேயபாவணர்",
                 
                 answer:3
                 },
                  
                 {
                 question:"நாடகத்தின் அடிப்படை அமைப்பு",
                 choice1:"இசை",
                 choice2:"போலச்செய்தல்", 
                 choice3:"பாட்டு",
                 choice4:"நடிப்பு",
                 
                 answer:2
                 },
                 
                 
                 {
                 question:"தமிழை வடமொழி வல்லாண்மையிலிருந்து மீட்பதற்காகவே இறைவன் என்னை படைத்தான் என்று கூறியவர் யார்?",
                 choice1:"பரிதிமாற் கலைஞர்",
                 choice2:"மறைமலை அடிகளார்", 
                 choice3:"மு வரத்தாசனார்",
                 choice4:"தேவநேயப்பாவனர்",
                 
                 answer:4
                 },
                 
                 
                 {
                 question:"கலையுரைத்த கற்பனையே நிலை என கொண்டாடும் கண்மூடி வழக்கமெலாம் மண்மூடிப் போக என்று கூறியவர் யார்?",
                 choice1:"வள்ளலார்",
                 choice2:"பெருஞ்சித்திரனார்",
                 choice3:"தாயுமானவர்",
                 choice4:"மறைமலை அடிகளார்",
                 
                 answer:1
                 },
                 
                  
                 {
                 question:"வெண்பா எவ்வகை ஓசை பெற்று வரும்",
                 choice1:"அகவல் ஓசை",
                 choice2:"செப்பலோசை",
                 choice3:"துள்ளகலாசை",
                 choice4:"தூங்ககலாசை",
                 
                 answer:2
                 },
                 
                 {
                 question:"அப்பா நான் வேண்டுதல் கேட்டு அருள் புரிதல் வேண்டும் ஆருயிர்கட் கெல்லாம்நான் அன்புசெயல் வேண்டும் என்று பாடியவர்?",
                 choice1:"திருநாவுக்கரசர்",
                 choice2:"திருஞானசம்பந்தர்", 
                 choice3:"மாணிக்கவாசகர்",
                 choice4:"வள்ளலார்",
                 
                 answer:4
                 },
      
                 {
                    question:"உடம்பிடை தோன்றிய ஒன்றை அறுத்த்தன் உதிரம் ஊற்றி என்று அறுவை சிகிச்சை மருத்துவத்றை பற்றி அன்றே பாடியவர் யார்?",
                    choice1:"அவ்வையார்",
                    choice2:"வள்ளுவர்",
                    choice3:"கம்பர் ",
                    choice4:"மாணிக்கவாசகர்", 
                    
                    answer:3
                    },
                    
                    {
                    question:"விளையாட்டின் அடிப்படை நோக்கம் என்ன?",
                    choice1:"வெற்றி",
                    choice2:"திறமை",
                    choice3:"போட்டியிடுதல்",
                    choice4:"ஆர்வம்",
                    
                    answer:3
                    },
                    
                    
                    {
                    question:"1913ஆம் ஆண்டு எந்த இடத்தில் வள்ளியம்மை கைது செய்யப்பட்டார்",
                    choice1:"வால்க்ஸ்ரஸ்ட்",
                    choice2:"ஜொகன்ஸ்பர்க்", 
                    choice3:"புதுச்சேரி",
                    choice4:"தில்லையாடி",
                    
                    answer:1
                    },
                    
                     
                    {
                    question:"நாடக உலகின் இமயமலை என்று அழைக்கப்படுவெர் யார்?",
                    choice1:"பரிதிமார் கலைஞர்",
                    choice2:"பம்மல் சம்பந்தனார்", 
                    choice3:"சங்கரதாஸ் சுவாமிகள்", 
                    choice4:"சுந்தரனார்",
                    
                    answer:3
                    },
                    
                    {
                    question:"தமிழ் மூவாயிரம் எனப்படும் நூல் எது?",
                    choice1:"தேவாரம்",
                    choice2:"திருவாசகம்",
                    choice3:"திருமந்திரம்",
                    choice4:"திருக்குறள்",
                    
                    answer:3
                    },
                    
                    
                    {
                    question:"உலகம் முழுவதையும் ஆள கருதுவர் எதற்காக காத்திருக்க வேண்டும்",
                    choice1:"படை வரும் வரை",
                    choice2:"பணம் வரும் வரை", 
                    choice3:"காலம் வரும்வரை",
                    choice4:"பலம் வரும் வரை",
                    
                    answer:3
                    },
                    
                    {
                    question:"26 முதல் 32 வயதுவரை உடைய பருவ மகளிர் எவ்வாறு அழைக்கப்படுவர்?", 
                    choice1:"மங்கை",
                    choice2:"மடந்தை", 
                    choice3:"அரிவை",
                    choice4:"தெரிவை",
                    
                    answer:4
                    },
                    
                     
                    {
                    question:"இணையில்லை முப்பாலுக்கு இந்நிலத்தே எனப் பாடியவர் யார்?",
                    choice1:"பாரதியார்",
                    choice2:"பாரதிதாசன்", 
                    choice3:"சுரதா",
                    choice4:"திருவள்ளுவர்",
                    
                    answer:2
                    },
                    
                     
                    {
                    question:"மாகதம் எனப்படுவது",
                    choice1:"மதுரகவி",
                    choice2:"சித்திரகவி", 
                    choice3:"ஆசுகவி",
                    choice4:"வித்தார கவி",
                    
                    answer:4
                    },
                    
                     
                    {
                    question:"ஆசாரக் கோவையின் ஆசிரியர் யார்?",
                    choice1:"நல்லாதனார்",
                    choice2:"பெருவாயின் முள்ளியார்", 
                    choice3:"முன்றுறை அரையனார்",
                    choice4:"காரியாசன்",
                    
                    answer:2
                    },
                    
                    
                    {
                    question:"வா என்ற வேர்ச் சொல்லின் தொழிற்பெயரை கண்டறிக?",
                    choice1:"வருதல்",
                    choice2:"வந்தான்", 
                    choice3:"வந்து",
                    choice4:"வந்த",
                    
                    answer:1
                    },
                    
                    {
                    question:"சாலை இளந்திரையன் தமிழக அரசின் பாவேந்தர் விருது பெற்த ஆண்டு?",
                    choice1:"1990",
                    choice2:"1993",
                    choice3:"1991",
                    choice4:"1994",
                    
                    answer:3
                    },
                    
                    
                    {
                    question:"தமிழ் இலக்கணம் படிக்க படிக்க விருப்பத்தை உண்டாக்குவது என்று கூறியவர் யார்?",
                    choice1:"அம்பேத்கர்",
                    choice2:"கெல்லட்",
                    choice3:"முனைவர் எமினோ", 
                    choice4:"மாக்ஸ்முல்லர்",
                    answer:2
                    },
                    
                    
                    {
                    question:"மேதி என்ற சொல்லுக்கான பொருள் என்ன?",
                    choice1:"அழகு",
                    choice2:"பசு",
                    choice3:"எருமை",
                    choice4:"சிவன்",
                    
                    answer:3
                    },
                    
                    
                    {
                    question:"தில்லையாடி வள்ளியம்மையின் தியாகத்தைப் பற்றி காந்தியடிகள் எந்த இதழில் எழுதியுள்ளார்?",
                    choice1:"இந்தியன் போஸ்ட்",
                    choice2:"பைன் ஆப்பிரிக்க சத்தியாகிரகம்", 
                    choice3:"இந்தியன் ஒப்பினியன்",
                    choice4:"இந்தியன் வீல்",
                    
                    answer:3
                    },
                    
                    {
                    question:"குருசு என்பதன் பொருள்",
                    choice1:"சிலுவை",
                    choice2:"ஏளனம்",
                    choice3:"சினம்",
                    choice4:"அடியார்",
                    
                    answer:1
                    },
                     
                    {
                    question:"அரசனைக் குறிக்கும் ஓரெழுத்து ஒரு மொழி என்ன?",
                    choice1:"பூ",
                    choice2:"கோ", 
                    choice3:"கா",
                    choice4:"ஆ",
                    
                    answer:2
                    },
                    
                    
                    {
                    question:"பெண்கள் உரிமை பெற்று புது உலகைப் படைக்க வேண்டும் என்று விரும்பியவர் யார்?",
                    choice1:"பாரதியார்",
                    choice2:"பாரதிதாசன்", 
                    choice3:"பெரியார்",
                    choice4:"அம்பேத்கார்", 
                    
                    answer:3
                    },
     
                    {
                       question:"புறநானூற்றில் சில பாடல்களை ஆங்கிலத்தில் மொழி பெயர்த்வைர் யார்?",
                       choice1:"கால்டுவெல்",
                       choice2:"பெஸ்கி",
                       choice3:"ஜி யு கொப்", 
                       choice4:"செல்லி",
                       
                       answer:3
                       },
                       
                       
                       {
                       question:"ஆனந்தரங்கர் எழுதிய நாட்குறிப்புகள் எத்தனை தொகுதிகள்?",
                       choice1:"10",
                       choice2:"12",
                       choice3:"14",
                       choice4:"16",
                       
                       answer:2
                       },
                       
                       
                       {
                       question:"கீழ்க்கண்டவற்றுள் பதினெண்கீழ்க்கணக்கு நூல்களுள் ஒன்று எது?",
                       choice1:"புறநானூறு",
                       choice2:"நற்றிதணை",
                       choice3:"நாலடியார்" ,
                       choice4:"பரிபாடல்",
                       
                       answer:3
                       },
                       
                       {
                       question:"உலகம் உருண்டை என்த கருத்து எவ்வாறுவியல் இயலின் பார்ப்படும்",
                       choice1:"விண்ணியல் அறிவு",
                       choice2:"பொறியியல் அறிவு",
                       choice3:"மண்ணியல் அறிவு",
                       choice4:"அறிவியல் அறிவு",
                       
                       answer:1
                       },
                       
                       {
                       question:"முக்கூடற்பள்ளு குறிய பாவகை",
                       choice1:"சிந்துப்பா",
                       choice2:"ஆசிரியப்பா", 
                       choice3:"வஞ்சிப்பா",
                       choice4:"வெண்பா",
                       
                       answer:1
                       },
     
                       {
                          question:"ஞானக் கண்ணாடி என்ற சமய நூலை இயற்றியவர் யார்?",
                          choice1:"கவைநாயகம் பிள்ளை",
                          choice2:"வீரமாமுனிவர்",
                          choice3:"கால்டுவெல்",
                          choice4:"போப்",
                          
                          answer:2
                          },
                          
                          
                          {
                          question:"உலகம் உயிர் கடவுள் ஆகிய மூன்றையும் ஒருங்கக காட்டும் காவியம் எது?",
                          choice1:"பெரியபுராணம்",
                          choice2:"கம்பராமாயணம்", 
                          choice3:"சிலப்பதிகாரம்",
                          choice4:"சீவகசிதாமணி",
                          
                          answer:1
                          },
                          
                          
                          {
                          question:"புரட்சி முழக்கம் என்னும் நூலை இயற்றியவர் யார்?",
                          choice1:"சாலை இளந்திரையன்",
                          choice2:"தேவநேயப் பாவாணர்",
                          choice3:"மறைமலை அடிகளார்",
                          choice4:"பரிதிமாற்கலைஞர்",
                          
                          answer:1
                          },
                          
                          {
                          question:"கடம் என்ற சொல்லின் பொருள் என்ன?",
                          choice1:"குடம்",
                          choice2:"பாம்பு",
                          choice3:"வேம்பு" ,
                          choice4:"உடம்பு",
                          
                          answer:4
                          },
                          
                          {
                          question:"தேசியம் காத்த செம்மல் என்று திரு.வி.க யாரை பாராட்டியுள்ளார்?",
                          choice1:"முத்துராமலிங்கர்",
                          choice2:"முத்துகிருஷ்ணன்",
                          choice3:"முத்தையா",
                          choice4:"முருகேசர்",
                          
                          answer:1
                          },
                          
                          {
                          question:"எள்ளல் இளமை அறியாமை மடமை ஆகிய நான்கு காரணங்களால் நகைச்சுவை தோன்றும் -எனக் கூறிய நூல்?",
                          choice1:"திருக்குதள்",
                          choice2:"சிலப்பதிகாரம்", 
                          choice3:"தொல்காப்பியம்", 
                          choice4:"நன்னூல்",
                          
                          answer:3
                          },
                          
                          
                          {
                          question:"அங்கக வேளாண்மை எனப்படுவது",
                          choice1:"செயற்கை வேளாண்மை",
                          choice2:"இயற்கை வேளாண்மை",
                          choice3:"மரபு பொறியியல் வேளாண்மை",
                          choice4:"மேற்கூறிய எதுவும் இல்லை",
                          
                          answer:2
                          },
                          
                          
                          {
                          question:"வன விலங்கு பாதுகாப்பு சட்டம்",
                          choice1:"1972",
                          choice2:"1978",
                          choice3:"1975",
                          choice4:"1980",
                          
                          answer:1
                          },
                          
                          {
                          question:"நம்மாழ்வார் பிறந்த ஊர்",
                          choice1:"இருகூர்",
                          choice2:"திருவூர்",
                          choice3:"குருகூர்",
                          choice4:"கருவூர்",
                          
                          answer:3
                          },
                          
                          
                          {
                          question:"உழவுக்கும் தொழிலுக்கும் வந்தனை செய்வோம் வீணில் உண்டு களித்திருப்கொரை நிந்தனை செய்வோம் - என்று பாடியவர் யார்?",
                          choice1:"அவ்வையார்",
                          choice2:"பாரதியார்",
                          choice3:"கம்பர்",
                          choice4:"பட்டுக்கோட்டை கல்யாணசுந்தரம்",
                          
                          answer:2
                          },
                          
                           
                          {
                          question:"நாளை என் தாய்மொழி சாகுமானால் இன்றே நான் இறந்து விடுவேன் என்று பாடியவர்?",
                          choice1:"பாரதியார்",
                          choice2:"பாரதிதாசன்", 
                          choice3:"ரசூல் கம்ச தேவ்",
                          choice4:"தேவநேயப் பாவணர்", 
                          
                          answer:3
                          },
                          
                          {
                          question:"இருத்தலும் இருத்தல் நிமித்தமும் -சரியானவற்றை நேர்க", 
                          choice1:"குறிஞ்சி",
                          choice2:"முல்லை",
                          choice3:"மருதம்",
                          choice4:"நெய்தல்", 
                          
                          answer:2
                          },
                          
                          {
                          question:"'களிறு எறிந்து பெயர்தல் காளைக்குக் கடனே' எந்த வரி இடம்பெற்றுள்ள நூல் எது?",
                          choice1:"சிலப்பதிகாரம்",
                          choice2:"தேவாரம்",
                          choice3:"திருக்குறள்", 
                          choice4:"புறநானூறு",
                          
                          answer:4
                          },
                          
                          {
                          question:"பெரிய புராணம் எழுதிட துணை நின்ற நூல் எது?",
                          choice1:"திருத்தொண்டத்தொகை",
                          choice2:"திருவாசகம்",
                          choice3:"திருக்கோவை", 
                          choice4:"திருவிளையாடல் புராணம்",
                          
                          answer:1
                          }, 
     
        
                          {
                             question:"மன்னன் முடி எனக்கு வேண்டியதில்லை அந்த மாதன் எனக்கு வேண்டியதில்லை -என்ற பாடலை பாடியவர் யார்?", 
                             choice1:"பூதஞ்சேந்தனார்",
                             choice2:"சச்சிதானந்தன்",
                             choice3:"பாரதிதாசன்",
                             choice4:"அசலாம்பிகை",
                             
                             answer:2
                             },
                             
                              
                             {
                             question:"ஆழி சரியான பொருளைக் கண்டறிக",
                             choice1:"நிலம்",
                             choice2:"கடல்",
                             choice3:"மாலை", 
                             choice4:"மதியம்",
                             
                             answer:2
                             },
                             
                             {
                             question:"விழுதும் வேரும் என்த தலைப்பில் உள்ள பாடல் எந்த நூலில் இருந்து எடுக்கப்பட்டது",
                             choice1:"அழகின் சிரிப்பு",
                             choice2:"தமிழச்சியின் கத்தி", 
                             choice3:"இருண்டவீடு",
                             choice4:"சேரதாண்டவம்",
                             
                             answer:1
                             },
                              
                             {
                             question:"பூங்கொடி, வீர காவியம் கொண்ட நூல்களை இயற்றியவர் யார்?",
                             choice1:"வானிதாசன்",
                             choice2:"வண்ந்தாசன்",
                             choice3:"முடியரசன்",
                             choice4:"மருதகாசி",
                             
                             answer:3
                             },
                             
                             
                             {
                             question:"எந்த நாட்டில் உள்ள அருங்காட்சியகத்தில் திருக்குறள் விவிலியத்துடன் வைக்கப்பட்டுள்ளது?",
                             choice1:"ரஷ்யா",
                             choice2:"அமெரிக்கா", 
                             choice3:"இங்கிலாந்து", 
                             choice4:"ஜப்பான்",
                             
                             answer:3
                             },
                             
                             {
                             question:"ரகசிய வழி என்னும் ஆங்கில நூலின் ஆசிரியர் யார்?", 
                             choice1:"ஜான் பனியன்",
                             choice2:"லிட்டன் பிரபு",
                             choice3:"ஜி யு போப்",
                             choice4:"எச் ஏ கிருஷ்ணபிள்ளை",
                             
                             answer:2
                             }, 
                             
                             
                             {
                             question:"அறிஞர் அண்ணாவிற்கு மிகவும் விருப்பமான இலக்கியம் எது?",
                             choice1:"பரணி",
                             choice2:"கலம்பகம்", 
                             choice3:"அந்தாதி",
                             choice4:"புதினம்",
                             
                             answer:1
                             },
                             
                             {
                             question:"சொல்லையும் பொருளையும் வரிசையாக நிறுத்தி நேரே பொருள் கொள்வது",
                             choice1:"ஏகதேச உருவக அணி",
                             choice2:"நிரல்நிறை அணி",
                             choice3:"உவமை அணி",
                             choice4:"சொற்பொருள் பின்வருநிலையணி",
                             
                             answer:2
                             },
                             
                              
                             {
                             question:"கைத்தொழில் ஒன்றை கற்றுக்கொள் வேலை உனக்கில்லை ஒத்துக்கொள் என்று பாடியவர் யார்?",
                             choice1:"மருதகாசி",
                             choice2:"கவிமணி",
                             choice3:"நாமக்கல் கவிஞர்", 
                             choice4:"முடியரசன்",
                             
                             answer:3
                             },
                             
                             
                             {
                             question:"நான் நிரந்தரமானவன் அழிவதில்லை எந்த நிலையிலும் எனக்கு மரணமில்லை - என்று கூறியவர் யார்?",
                             choice1:"நாமக்கல் கவிஞர்",
                             choice2:"பாரதியார்",
                             choice3:"கண்ணைாசன்", 
                             choice4:"மருதகாசி",
                             
                             answer:3
                             },
                             
                             
                             {
                             question:"திருவிளையாடல் புராணத்திற்கு உரை எழுதியவர் யார்?",
                             choice1:"நா மு வேங்கடசாமி நாட்டார்",
                             choice2:"நச்சினார்கினியார்",
                             choice3:"அடியார்க்கு நல்லார்", 
                             choice4:"மறைமலை அடிகளார்",
                             
                             answer:1
                             },
                             
                              
                             {
                             question:"பள்ளிப் பறவைகள் என்ற நூலின் ஆசிரியர் யார்?",
                             choice1:"பெருஞ்சித்திரனார்",
                             choice2:"தேவநேயப்பாவணர்",
                             choice3:"மீரா",
                             choice4:"சுரதா",
                             
                             answer:1
                             },
                          
                             {
                             question:"ஞானப் பச்சிலை என்று வள்ளலார் குறிப்பிடுவது எதை?", 
                             choice1:"துளசி",
                             choice2:"தூதுவளை", 
                             choice3:"கற்றாழை",
                             choice4:"கீழாநெல்லி",
                             
                             answer:2 
                             },
                             
                             {
                             question:"நெடுநல்வாடை என்ற நூலை இயற்றியவர் யார்?",
                             choice1:"கம்பர்",
                             choice2:"நக்கீரர்",
                             choice3:"கபிலர்",
                             choice4:"மாங்குடி மருதனார்",
                             
                             answer:2
                             },  
     
      
                             {
                                question:"நட என்ற வேர் சொல்லின் பெயபரச்சம் காண்க",
                                choice1:"நடந்தான்",
                                choice2:"நடந்து",
                                choice3:"நடந்த",
                                choice4:"நடந்தவன்",
                                
                                answer:3
                                },
                                 
                                {
                                question:"பொலிட்டிக்கல் சயின்ஸ் என்பதற்கு நிகரான தமிழ்ச் சொல் என்ன",
                                choice1:"அரசியல் அறிவியல்" ,
                                choice2:"அடிப்படை அறிவியல்", 
                                choice3:"அனுபவ அறிவியல்",
                                choice4:"பெரிய அரசியல்",
                                
                                answer:1
                                },
                                
                                
                                {
                                question:"போரில் வெற்றி பெற்வைர் பெயரில் பாடப்படும் சிற்றிலக்கியம்", 
                                choice1:"உலா",
                                choice2:"பங்கு",
                                choice3:"பரணி",
                                choice4:"கலம்பகம்",
                                
                                answer:3
                                }, 
                                
                                {
                                question:"சொற்களை ஒழுங்குபடுத்தி சரியான சொற்தொடரை தேர்ந்தெடுக்க", 
                                choice1:"நன்றும் தீதும் பிதர் தர",
                                choice2:"நன்றும் பிறர்தர தீதும்",
                                choice3:"தீதும் நன்றும் பிறர் தர வாரா",
                                choice4:"பிற்ர் தர வாரா நன்றும் தீதும்",
                                
                                answer:3
                                },
                                
                                {
                                question:"உலகெலாம் உணர்ந்து ஓதற்கு அரியவன் எனத் தொடங்கும் பாடல் இடம்பெற்றுள்ள நூல் எது?",
                                choice1:"திருவாசகம்",
                                choice2:"திருவிளையாடல் புராணம்", 
                                choice3:"பெரியபுராணம்",
                                choice4:"தேவாரம்",
                                
                                answer:3
                                },
                                
                                {
                                question:"சமூக சமுதாய சீர்திருத்தம் தொடர்பான நாடகங்கள் சிறப்பிடம் பெற்ற காலம்", 
                                choice1:"பதிபனட்டாம் நூற்றாண்டு",
                                choice2:"பத்தொன்பதாம் நூற்றாண்டு", 
                                choice3:"பதினேழாம் நூற்றாண்டு",
                                choice4:"இருபதாம் நூற்றாண்டு",
                                
                                answer:2
                                },
                                
                                {
                                question:"வள்ளை என்பதன் பொருள்",
                                choice1:"நெல் குத்தும்போது பெண்கள் பாடும் பாட்டு",
                                choice2:"விளையாடும் போது பெண்கள் பாடும் பாட்டு", 
                                choice3:"நடவு நடும் போது பெண்கள் பாடும்பாட்டு",
                                choice4:"பெண்கள் பாடும் கும்மி பாட்டு",
                                
                                answer:1
                                },
                                
                                {
                                question:"ஊஞ்சல் கயிறு போல ஒரு சொல் முன்னும் பின்னுமாய் சென்று பொருள் கொள்ளத்தக்க வகையில் அமைவது எவ்வகை பொருள்கோளாகும்", 
                                choice1:"கொண்டுகூட்டுப் பொருள்கோள்",
                                choice2:"ராப்பிசைப் பொருள்கோள்",
                                choice3:"நிரல்நிறை பொருள்கோள்",
                                choice4:"அடி மாற்று பொருள்கோள்",
                                
                                answer:2
                                },
                                
                                
                                {
                                question:"ஆயுத எழுத்துக்கு எத்தனை மாத்திரை", 
                                choice1:"1",
                                choice2:"2",
                                choice3:"1/2" ,
                                choice4:"3",
                                
                                answer:3
                                },
                                
                                
                                {
                                question:"கம்பர் - அம்பிகாவதி வரலாற்றை வைத்து கண்ணைாசன் படைத்த இனிய நாடகம்",
                                choice1:"ஆயிரம் தீவு",
                                choice2:"ராஜ தண்டனை", 
                                choice3:"சேரமான் காதலி", 
                                choice4:"மாங்கனி",
                                
                                answer:2
                                },
                                
                                
                                {
                                question:"திரைகடல் ஓடியும் திரவியம் தேடு என்று கூறியவர் யார்?",
                                choice1:"நச்சினார்க்கினியார்",
                                choice2:"ஓதலாந்தையார்",
                                choice3:"பொன்முடியார்",
                                choice4:"அவ்வையார்",
                                answer:4
                                },
                                
                                {
                                question:"வருவான் என்பது", 
                                choice1:"எதிர்மறை இடைநிலை",
                                choice2:"எதிர்கால இடைநிலை",
                                choice3:"நிகழ்கால இடைநிலை",
                                choice4:"இறந்தகால இடைநிலை",
                                 
                                answer:2
                                },
                                
                                
                                {
                                question:"உன் மானத்தை விட நாட்டின் மானம் பெரியது என்று உணர் உன் உயர்வை விட நாட்டின் உயர்வு இன்றியமையாதது என்பதை உணர் என்று கூறியவர் யார் அறிஞர்",
                                choice1:"அண்ணா",
                                choice2:"கலைஞர்",
                                choice3:"மு.வ",
                                choice4:"விவேகானந்தர்",
                                
                                answer:3
                                },
     
                                {
                                   question:"மருமக்கள் வழி மான்மியம் என்ற நூலின் ஆசிரியர் யார்?",
                                   choice1:"திரு வி க",
                                   choice2:"கவிமணி",
                                   choice3:"ரசிகமணி",
                                   choice4:"நாமக்கல் கவிஞர்",
                                   
                                   answer:2
                                   },
                                   
                                   {
                                   question:"பற்றுக பற்றற்றான் பற்றினை அப்பற்றைப் பற்றுக பற்று விடற்கு வேர்ச்சொல்லை தேர்க", 
                                   choice1:"பற்றுக",
                                   choice2:"பற்றற்றான்", 
                                   choice3:"பற்றி",
                                   choice4:"பற்று",
                                   
                                   answer:4
                                   },
                                 
                                   { 
                                   question:"ஈற்றயலடி சிந்தடி பெற்று வரும் பா வகை எது?",
                                   choice1:"நேரின ச் சிந்தியல் வெண்பா",
                                   choice2:"இன்னிசை சிந்தியல் வெண்பா", 
                                   choice3:"நிலைமண்டில ஆசிரியப்பா",
                                   choice4:"நேரிசை ஆசிரியப்பா",
                                   
                                   answer:4
                                   },
                                   
                                   {
                                   question:"ஓங்கு என்னும் அடைமொழியை பெற்ற நூல் எது?", 
                                   choice1:"நற்றினை",
                                   choice2:"குறுந்தொகை",
                                   choice3:"அகநானூறு",
                                   choice4:"பரிபாடல்",
                                   
                                   answer:4
                                   },
                                   
                                   {
                                   question:"திலகர் விதைத்த விதை பாரதியாக முளைத்தது என்று கூறியவர் யார்?",
                                   choice1:"காந்திஜி",
                                   choice2:"நேருஜி",
                                   choice3:"ராஜாஜி",
                                   choice4:"நேதாஜி",
                                   
                                   answer:3
                                   },
                                   
                                   {
                                   question:"என்றுமுள தென்தமிழ் என்னும் தொடரை கூறியவர் யார்?",
                                   choice1:"கம்பர்",
                                   choice2:"பாரதியார்",
                                   choice3:"பாரதிதாசன்",
                                   choice4:"வள்ளலார்",
                                   
                                   answer:1
                                   },
                                   
                                   {
                                   question:"ரூபாயத் என்ற பெயரில் யாருடைய பாடலை யார் மொழிபெயர்த்தார்?",
                                   choice1:"கவிமணி, உமர்கய்யாம்",
                                   choice2:"உமர்கய்யாம்,கவிமணி",
                                   choice3:"கவிமணி, ஜி யு போப்",
                                   choice4:"ஜி யு போப், வீரமாமுனிவர்",
                                   
                                   answer: 2
                                   }, 
                                   
                                   {
                                   question:"கிளியை வளர்த்து பூனையின் கையில் கொடுத்தது போல என்னும் உவமை உணர்த்தும் பொருள் யாது?",
                                   choice1:"இன்பம்",
                                   choice2:"துன்பம்",
                                   choice3:"மகிழ்ச்சி", 
                                   choice4:"வருமுன் காத்தல்", 
                                   
                                   answer:2
                                   },
                                   
                                   {
                                   question:"ஒவ்வொரு பாடலில் உள்ள இறுதி எழுத்தோ அடியோ சீரோ அடியோ அல்லது அதற்கு அடுத்து வரும் பாடலில் முன்னதாக வரும்படி அமைத்துப் பாடுவது எனப்படும்",
                                   choice1:"இலக்கியம்",
                                   choice2:"கலம்பகம்",
                                   choice3:"அந்தாதி",
                                   choice4:"பரணி",
                                   
                                   answer:3
                                   },
                                   
                                   
                                   {
                                   question:"நாககுமார காவியம் எத்தனை செய்யுளைகொண்டது?",
                                   choice1:"1894",
                                   choice2:"2131", 
                                   choice3:"170",
                                   choice4:"3145", 
                                   
                                   answer:3
                                   },
                                   
                                   {
                                   question:"குலசேகர ஆழ்வார் வாழ்ந்த காலம்",
                                   choice1:"கிபி ஏழாம் நூற்றாண்டு",
                                   choice2:"ஆறாம் நூற்றாண்டு",
                                   choice3:"கிபி ஒன்பதாம் நூற்றாண்டு", 
                                   choice4:"கிபி ஐந்தாம் நூற்றாண்டு",
                                   
                                   answer:3
                                   },
                                   
                                   {
                                   question:"கற்றல் என்பதன் வேர்ச்சொல் என்ன?",
                                   choice1:"கற்று",
                                   choice2:"கல்",
                                   choice3:"கற்ற", 
                                   choice4:"கற்",
                                   
                                   answer:2
                                   },
     
                                   {
                                      question:"தமிழின் முதல் சிறுகதை எது?",
                                      choice1:"புதியதும் பழயதும்",
                                      choice2:"பிரதாப முதலியார் சரித்திரம்", 
                                      choice3:"குனத்தங்கரை அரசமரம்",
                                      choice4:"யுக சக்தி",
                                      
                                      answer:3
                                      },
                                       
                                      {
                                      question:"வஞ்சிக் காண்டத்தில் உள்ள காதைகளின் எண்ணிக்கை என்ன",
                                      choice1:"13",
                                      choice2:"7",
                                      choice3:"10", 
                                      choice4:"5",
                                      
                                      answer:2
                                      },
                                      
                                      {
                                      question:"தஞ்சாவூர் பெயர்ச் சொல்லின் வகை அறிக",
                                      choice1:"பொருட் பெயர்",
                                      choice2:"பண்புப்பெயர்",
                                      choice3:"கானப் பெயர்",
                                      choice4:"இடப்பெயர்",
                                      
                                      answer:4
                                      },
                                      
                                      {
                                      question:"தாயுமானவரின் ஆசிரியர் பெயர்",
                                      choice1:"திருமூலர்",
                                      choice2:"மௌனகுரு", 
                                      choice3:"விஜயரங்க சச்சிதானந்தா நாயக்கர்",
                                      choice4:"கேடிலியப்ப பிள்ளை",
                                      
                                      answer:2
                                      },
                                      
                                      
                                      {
                                      question:"தேவநேயப் பாவானர் எழுதிய நூல்களின் எண்ணிக்கை என்ன?", 
                                      choice1:"41",
                                      choice2:"42",
                                      choice3:"43",
                                      choice4:"40",
                                      
                                      answer:3
                                      },
                                      
                                      
                                      {
                                      question:"முத்தமிழ் காவலர் என்று அனழக்கப்பட்டவர் யார்?",
                                      choice1:"விஸ்வநாதன்",
                                      choice2:"விநாயகம் பிள்ளை", 
                                      choice3:"கண்னதாசன்",
                                      choice4:"பெருஞ்சித்திரனார்",
                                      
                                      answer:1
                                      },
                                      
                                      
                                      {
                                      question:"வீரமாமுனிவருக்கு தமிழ் கற்பித்த ஆசிரியர் யார்",
                                      choice1:"வரதராசன்",
                                      choice2:"மதுரை சுப்பிரதீபக் கவிராயர்",
                                      choice3:"உவே சாமிநாத ஐயர்",
                                      choice4:"ஆறுமுகநாவலர்",
                                      
                                      answer:2
                                      },
                                      
                                      
                                      {
                                      question:"ஒழுக்கம் விழுப்பம் தரலான் இந்த அடியில் ஒழுக்கம் என்னும் வார்த்தை எந்த இலக்கணத்தை சார்ந்து",
                                      choice1:"பண்புப் பெயர்",
                                      choice2:"தொழிற் பெயர்",
                                      choice3:"வினையானனையும் பெயர்", 
                                      choice4:"பெயசரச்சம்",
                                      
                                      answer:2
                                      },
                                      
                                      {
                                      question:"மரப்பாவை நானால் உயிர்மருட்டி போன என்ற உவமையின் பொருனை வேர்ந்தெடுக்க",
                                      choice1:"அரிய செயல்",
                                      choice2:"முயற்சி",
                                      choice3:"புத்துனர்வு", 
                                      choice4:"மயங்குதல்", 
                                      
                                      answer:1
                                      },
                                      
                                      
                                      {
                                      question:"கீழ்காண்பனவைகளில் தொழிற்பெயர் அல்லாத சொல் எது?",
                                      choice1:"எள்ளல்",
                                      choice2:"தருதல்",
                                      choice3:"கோறல்",
                                      choice4:"கொல்லாமை",
                                      
                                      answer:4
                                      },
                                      
                                      
                                      {
                                      question:"தொண்டர் சீர் பரவுவார் என்று வழங்கப்படுவர் யார்?",
                                      choice1:"கம்பர்",
                                      choice2:"வடக்கிழார்",
                                      choice3:"ராமலிங்க அடிகள்",
                                      choice4:"சுந்தரர்",
                                      
                                      answer:2
                                      },
                                      
                                      {
                                      question:"பகுத்தறிவு கவிராயர் என வழங்கப்படுபவர் யார்?",
                                      choice1:"இராமச்சந்திர கவிராயர்",
                                      choice2:"கவிகாளமேகம்",
                                      choice3:"உடுமனை நாராயணகவி",
                                      choice4:"திரிகூடராசப்பக் கவிராயர்", 
                                      
                                      answer:3
                                      },
                                      
                                      {
                                      question:"முக்தி நூல் என்ற அடைமொழிக் கொண்ட நூல் யாது?",
                                      choice1:"மணிமேகலை",
                                      choice2:"சீவகசிந்தாமணி", 
                                      choice3:"குண்டலகேசி",
                                      choice4:"வளையாபதி",
                                      
                                      answer:2
                                      },
                                      
                                      {
                                      question:"99 வகையான மலர்கனை கொண்ட நூல் எது?",
                                      choice1:"குறிஞ்சிப்பாட்டு",
                                      choice2:"பட்டினப்பாலை",
                                      choice3:"திருமுருகாற்றுப்படை", 
                                      choice4:"பொருநராற்றுப்படை",
                                      
                                      answer:1
                                      },
                                      
                                      
                                      {
                                      question:"திருவாய்மொழி எனும் நூல் எந்த அடைமொழியால் அழைக்கப்படுகிறது?", 
                                      choice1:"ரிக் வேதம்",
                                      choice2:"யஜுர் வேதம்",
                                      choice3:"தமிழ் வேதம்", 
                                      choice4:"திராவிட வேதம்", 
                                      
                                      answer:3
                                      },
                                      
                                      
                                      {
                                      question:"கிறிஸ்துவ கம்பர் என அனழக்கப்படுபவர்?",
                                      choice1:"வீரமாமுனிவர்",
                                      choice2:"மறைமலை அடிகள்", 
                                      choice3:"எச்.ஏ.கிருஷ்னபிள்ளை", 
                                      choice4:"கம்பர்",
                                      
                                      answer:3
                                      },
                                      
                                      {
                                         question:"நெடுந்தொகை அடைமொழியால் அனழக்கப்படும் நூல் எது?",
                                         choice1:"குறுந்தொகை",
                                         choice2:"ஐங்குறுநூறு",
                                         choice3:"அகநானூறு",
                                         choice4:"நற்றினை",
                                         
                                         answer:3
                                         },
                                         
                                         
                                         {
                                         question:"இலக்கிய உலகத்தினரால் தமிழ் உரைநடையின் தந்தை எனப் போற்றப்படுபவர் யார்?",
                                         choice1:"இளம்பூரனார்",
                                         choice2:"திருவிக",
                                         choice3:"மறைமலை அடிகளார்", 
                                         choice4:"பரிவமேழழகர்",
                                         
                                         answer:2
                                         },
                                         
                                         
                                         {
                                         question:"பிள்ளைப்பெருமாள் ஐயங்கார் அவர்களுக்கு வழங்கப்படும் வேறு பெயர் என்ன?",
                                         choice1:"நல்லாப்பிள்ளை",
                                         choice2:"படிக்காசுப் புலவர்", 
                                         choice3:"அழகிய மனவாளதாசர்", 
                                         choice4:"மணாளர்",
                                         
                                         answer:3
                                         },
                                         
                                         
                                         {
                                         question:"மரபுக்கவிதையின் வேர் பார்த்தவர் புதுக்கவிதையின் மலர் பார்த்தவர் என்று பாராட்டப்படுபவர் யார்?",
                                         choice1:"சுரதா",
                                         choice2:"பாரதியார்", 
                                         choice3:"சிற்பி பாலசுப்பிரமணியம்",
                                         choice4:"அப்துல் ரகுமான்",
                                         
                                         answer:4
                                         },
                                         
                                         
                                         {
                                         question:"தமிழ் வியாசர் என வழங்கப்படும் சான்றோர் யார்?",
                                         choice1:"சேரமான் பெருமாள் நாயனார்",
                                         choice2:"நாற்கவிரா நம்பி",
                                         choice3:"சேந்தையார்",
                                         choice4:"நம்பியாண்டார் நம்பி", 
                                         
                                         answer:4
                                         },
                                         
                                         
                                         
                                         {
                                         question:"தமிழில் தோன்றிய முதல் நாவல்" ,
                                         choice1:"கமலாம்பாள் சரித்திரம்",
                                         choice2:"தீனதயாளு" ,
                                         choice3:"சாவித்திரி சரித்திரம்", 
                                         choice4:"பிரதாப முதலியார் சரித்திரம்",
                                         
                                         answer:4
                                         },
                                         
                                         
                                         
                                         {
                                         question:"சுட்டவன் இச் சொல்லின் வேர்ச்சொல்லை அறிக ",
                                         choice1:"சுட்டு",
                                         choice2:"சுட்ட",
                                         choice3:"சுடுக",
                                         choice4:"சுடு",
                                         
                                         answer:4
                                         },
                                         
                                         
                                         {
                                         question:"கொண்டான் இச் சொல்லின் வேர்ச்சொல்லைக் காண்க",
                                         choice1:"கொண்டு",
                                         choice2:"கொண்ட",
                                         choice3:"கொள்",
                                         choice4:"கொள்க", 
                                         
                                         answer:3
                                         },
                                         
                                         
                                         {
                                         question:"உச்சிமேற் புலவர் என்னும் சிறப்புப் பட்டம் பெற்றவர் யார்?",
                                         choice1:"ஓதலையாந்தயார்",
                                         choice2:"நச்சினார்கினியார்",
                                         choice3:"நக்கண்னையார்",
                                         choice4:"அவ்வையார்",
                                         
                                         answer:2
                                         },
                                         
                                         
                                         {
                                         question:"பொருந்தாத சொல்லை கண்டறிக ",
                                         choice1:"ஏங்கு",
                                         choice2:"தூங்கு", 
                                         choice3:"வாங்கு", 
                                         choice4:"கொங்கு", 
                                         
                                         answer:4
                                         },
                                         
                                         
                                         {
                                         question:"இளங்கோ பாடம் படித்தான் இது எவ்வகை வாக்கியம் எனச் சுட்டுக",
                                         choice1:"பிறவினை வாக்கியம்",
                                         choice2:"செய்வினை வாக்கியம்", 
                                         choice3:"செய்தி வாக்கியம்",
                                         choice4:"தன்வினை வாக்கியம்", 
                                         
                                         answer:4
                                         },      
                                         
     
                                         {
                                            question:"செய்வினை சொற்றொடரைக் கண்டறிக", 
                                            choice1:"மாவட்ட ஆட்சியரால் கொடிவயற்றப்பட்டது",
                                            choice2:"மாவட்ட ஆட்சியர் கொடி ஏற்றினார்",
                                            choice3:"ஏற்றினார் கோடியை மாவட்ட ஆட்சியர்",
                                            choice4:"மாவட்ட ஆட்சியர் கொடி ஏற்றுவார்",
                                            
                                            answer:2
                                            },
                                            
                                            
                                            {
                                            question:"தமிழில் தோன்றிய முதல் உலா எது?",
                                            choice1:"மூவருலா",
                                            choice2:"ஞான உலா",
                                            choice3:"திருவாரூர் உலா",
                                            choice4:"திருவானைக்கா உலா", 
                                            
                                            answer:2
                                            },
                                            
                                            
                                            {
                                            question:"தெருளும் திறம் திரிதல் அல்லால் வெருள எழுந்து இவற்றுள் எது தொழிற்பெயர்",
                                            choice1:"திறம்",
                                            choice2:"திரிதல்", 
                                            choice3:"அல்லல்", 
                                            choice4:"எழுந்து",
                                            
                                            answer:2
                                            },
                                            
                                            
                                            {
                                            question:"தொடைகளின் வகைகள் எத்தனை?",
                                            choice1:"4",
                                            choice2:"5",
                                            choice3:"6",
                                            choice4:"7",
                                            
                                            answer:2
                                            },
                                            
                                            
                                            {
                                            question:"வாழாதார் என்பதன் இலக்கண்க் குறிப்பை காண்க",
                                            choice1:"எதிர்மறை தொழிற் பெயர்",
                                            choice2:"வினையானனையும் பெயர்", 
                                            choice3:"எதிர்மறை வினையானனையும் பெயர்", 
                                            choice4:"தொழிற் பெயர்",
                                            
                                            answer:3
                                            },
                                            
                                            {
                                            question:"குழந்தை கவிஞர் என்று அனழக்கப்படுபவர் யார்",
                                            choice1:"அழ.வள்ளியப்பன்",
                                            choice2:"கண்னதாசன்",
                                            choice3:"தேசிகவிநாயகம் பிள்ளை",
                                            choice4:"பாரதியார்",
                                            
                                            answer:1
                                            },
                                            
                                            
                                            {
                                            question:"மாக்கதை என வழங்கப்படும் காப்பியம்",
                                            choice1:"பெருங்கதை",
                                            choice2:"பெரியபுராணம்", 
                                            choice3:"குண்டலகேசி",
                                            choice4:"வளையாபதி",
                                            
                                            answer:1
                                            },
                                            
                                            {
                                            question:"நிலத்தினும் பெரிவே வானினும் உயர்ந்தன்று நீரினும் ஆரள வின்ரே இப்பாடல் வரிகள் இடம்பெற்றுள்ன நூல் எது?",
                                            choice1:"கலித்தொகை",
                                            choice2:"குறுந்தொகை",
                                            choice3:"திருக்குறள்",
                                            choice4:"புறநானூறு",
                                            
                                            answer:4
                                            },
                                            
                                            
                                            {
                                            question:"உடும்பு பிடி போல உவமையால் விளக்கப்பெறும் பொருத்தமான பொருனைத் வேர்ந்தெடுக்க",
                                            choice1:"வா���்க���வாதம்",
                                            choice2:"பிடிவாதம்",
                                            choice3:"கடும் வாக்குவாதம்",
                                            choice4:"கோபம் அடைதல்",
                                            
                                            answer:2
                                            },
     
                                            {
                                               question:"நன்று பெயர்ச்ச சொல்லின் வகை அறிக",
                                               choice1:"தொழிற் பெயர்",
                                               choice2:"பண்புப்பெயர்",
                                               choice3:"பொருட்பெயர்",
                                               choice4:"இடப்பெயர்",
                                               
                                               answer:2
                                               },
                                               {
                                               question:"சதுரம் பெயர்ச்ச சொல்லின் வகையறிக",
                                               choice1:"பண்புப் பெயர்",
                                               choice2:"இடப்பெயர்",
                                               choice3:"கானப்பெயர்", 
                                               choice4:"சினைப்பெயர்",
                                               
                                               answer: 1
                                               },
                                               {
                                               question:"ஆ என்னும் ஓரெழுத்து ஒரு மொழிக்குரிய பொருள் யாது",
                                               choice1:"பெண் மான்",
                                               choice2:"புலி",
                                               choice3:"சிங்கம்", 
                                               choice4:"கரடி",
                                               
                                               answer:1
                                               },
                                               {
                                               question:"ஐ என்னும் ஓரெழுத்து ஒரு மொழிக்குரிய பொருள் யாது?",
                                               choice1:"சீடன்",
                                               choice2:"முனிவன்", 
                                               choice3:"குரு",
                                               choice4:"இந்திரன்", 
                                               
                                               answer:3
                                               },
                                               {
                                               question:"ஈ என்னும் ஓரெழுத்து ஒரு மொழிக்குரிய பொருள் யாது?",
                                               choice1:"எடு",
                                               choice2:"வடு",
                                               choice3:"உயிரி", 
                                               choice4:"படு",
                                               
                                               answer:3
                                               },
                                               {
                                               question:"அ என்னும் ஓரெழுத்து ஒரு மொழிக்குரிய பொருள் யாது?",
                                               choice1:"9" ,
                                               choice2:"10", 
                                               choice3:"8",
                                               choice4:"5",
                                               
                                               answer:3
                                               },
                                               {
                                               question:"இ என்னும் ஓரெழுத்து ஒரு மொழிக்குரிய பொருள் யாது?",
                                               choice1:"புகழ்தல்",
                                               choice2:"இகழ்தல்",
                                               choice3:"வாழ்த்தல்", 
                                               choice4:"பற்றல்",
                                               
                                               answer:2
                                               },
                                               {
                                               question:"எழுப்பி இச் சொல்லின் வேர்ச்சொல்லை காண்க",
                                               choice1:"எழுதல்",
                                               choice2:"எழும்",
                                               choice3:"எழா",
                                               choice4:"எழு",
                                               
                                               answer:4
                                               },
                                               
                                               {
                                               question:"எய்திய இச்ச சொல்லின் வேர்ச்சொல்லை காண்க",
                                               choice1:"எய்து",
                                               choice2:"எய்த",
                                               choice3:"எய்துக", 
                                               choice4:"எய்தி",
                                               
                                               answer:1
                                               },
                                               {
                                               question:"பொருந்தாத சொல்னை கண்டறிக",
                                               choice1:"வேப்பம்பூ",
                                               choice2:"பைம்பூ",
                                               choice3:"காகித பூ", 
                                               choice4:"அத்திப்பூ",
                                               
                                               answer:3
                                               },
                                               {
                                                  question:"பொருந்தாத சொல்னை கண்டறிக",
                                                  choice1:"புலி",
                                                  choice2:"கரடி",
                                                  choice3:"மயில", 
                                                  choice4:"சிங்கம்", 
                                                  
                                                  answer:3
                                                  },
                                                  {
                                                  question:"மரபுப் பிழைகள் நீக்கிய தொடரைக் குறிப்பிடுக",
                                                  choice1:"கோழி கூவும்",
                                                  choice2:"கோழி கொக்கரிக்கும்", 
                                                  choice3:"கோழி கத்தும்",
                                                  choice4:"கோழி குனுகும்", 
                                                  
                                                  answer:2
                                                  },
                                                  {
                                                  question:"இயற்கை ஓவியம் என போற்றப்படும் நூல் எது?",
                                                  choice1:"முல்லைப்பாட்டு",
                                                  choice2:"குறிஞ்சிப்பாட்டு",
                                                  choice3:"பத்துப்பாட்டு",
                                                  choice4:"பரிபாடல்",
                                                  
                                                  answer:3
                                                  },
                                                  
                                                  {
                                                  question:"பொய்யில் புலவர் என வழங்கப்படுபவர் யார் ?", 
                                                  choice1:"வினம்பிநாயகர்",
                                                  choice2:"சாத்தனார்",
                                                  choice3:"பாரதியார்",
                                                  choice4:"திருவள்ளுவர்",
                                                  
                                                  answer:4
                                                  },
                                                  
                                                  {
                                                   question:"கப்பலோட்டிய தமிழன் யார்?",
                                                  choice1:"வ உ சி",
                                                  choice2:"நேதாஜி",
                                                  choice3:"ராஜாஜி",
                                                  choice4:"சிவாஜி",
                                                  
                                                  answer:1
                                                  },
                                                  
                                                  {
                                                  question:"இயற்கை இன்பக்கலம் என்று போற்றப்படும் நூல்",
                                                  choice1:"கலித்தொகை",
                                                  choice2:"அகநானூறு",
                                                  choice3:"குறுந்தொகை",
                                                  choice4:"சீவகசிந்தாமணி", 
                                                  
                                                  answer:1
                                                  },
                                                  
                                                  {
                                                  question:"செந்நாப்போதார் என்ற அடைமொழியால் குறிக்கப் பெறுபவர்",
                                                  choice1:"அவ்வையார்",
                                                  choice2:"கபிலர்",
                                                  choice3:"திருவள்ளுவர்",
                                                  choice4:"பாரதியார்",
                                                  
                                                  answer:3
                                                  },
                                                  
                                                  {
                                                  question:"தடக்கை என்பதன் இலக்கண குறிப்பை காண்க",
                                                  choice1:"பெயர்ச்சொல்",
                                                  choice2:"இடப்பெயர்",
                                                  choice3:"உரிச்சொற்றொடர்",
                                                  choice4:"உருவகம்",
                                                  
                                                  answer:3
                                                  },
                                                  
                                                  
                                                  {
                                                  question:"ஒதல் என்பதன் இலக்கண குறிப்பை காண்க",
                                                  choice1:"செய்யுள் இசை அளபெடை",
                                                  choice2:"இன்னிசை அளபெடை",
                                                  choice3:"சொல்லிசை அளபெட", 
                                                  choice4:"வினைமுற்று",
                                                  
                                                  answer:1
                                                  },
                                                  
                                                  
                                                  {
                                                  question:"வாழ்க என்பதன் இலக்கணக குறிப்பு தேர்க",
                                                  choice1:"வேற்றுமைத் தோடர்",
                                                  choice2:"இலக்கணப்போலி",
                                                  choice3:"உரிச்சொல்",
                                                  choice4:"வியங்கோள் வினைமுற்று", 
                                                  
                                                  answer:4
                                                  },
                                                  
                                                  
                                                  {
                                                  question:"ஞானக்கண் என்பதன் இலக்கண குறிப்பு",
                                                  choice1:"உருவகம்",
                                                  choice2:"உவமைத் தொகை", 
                                                  choice3:"பண்புத் தொகை",
                                                  choice4:"வினைத் தொகை",
                                                  
                                                  answer:1
                                                  },
                                                  
                                                  
                                                  {
                                                  question:"இழ என்னும் வேர்ச்ச சொல்லின் வினைமுற்றை வேர்ந்தேடுக்க",
                                                  choice1:"இழந்து",
                                                  choice2:"இழந்த",
                                                  choice3:"இழத்தல்", 
                                                  choice4:"இழந்தோம்",
                                                  
                                                  answer:4
                                                  },
                                                  
                                                  
                                                  {
                                                  question:"பேரறிஞர் அண்னா மறைந்தார் என்பது எவ்வகை வாக்கியம் எனச் சுட்டுக",
                                                  choice1:"வினா வாக்கியம்",
                                                  choice2:"செய்தி வாக்கியம்",
                                                  choice3:"கட்டளை வாக்கியம்",
                                                  choice4:"உணர்ச்சி வாக்கியம்",
                                                  
                                                  answer:2
                                                  },
                                                  
                                                  
                                                  {
                                                  question:"அனைவரும் தாய்மொழியை போற்றுக எவ்வகை வாக்கியம் எனச் சுட்டுக",
                                                  choice1:"கட்டளை வாக்கியம்",
                                                  choice2:"உணர்ச்சி வாக்கியம்",
                                                  choice3:"வினா வாக்கியம்",
                                                  choice4:"செய்தி வாக்கியம்",
                                                  
                                                  answer:1
                                                  },
                                                  
                                                  {
                                                  question:"நூ என்னும் ஓரெழுத்து ஒரு மொழிக்குரிய பொருள் யாது?",
                                                  choice1:"வேர்",
                                                  choice2:"புத்தகம்", 
                                                  choice3:"அணிகலன்", 
                                                  choice4:"உடை",
                                                  
                                                  answer:3
                                                  },
                                                  
                                                  {
                                                  question:"மா என்னும் ஓரெழுத்து ஒரு மொழிக்குரிய பொருள் யாது?",
                                                  choice1:"மாடு",
                                                  choice2:"மான", 
                                                  choice3:"மாமரம",
                                                  choice4:"மான்",
                                                  
                                                  answer:3
                                                  },
                                                  
                                                  {
                                                  question:"எதிர்ச்சொல் தருக –மலர்தல்", 
                                                  choice1:"விரிதல்",
                                                  choice2:"கூம்பல்",
                                                  choice3:"சுருங்குதல்", 
                                                  choice4:"வேய்தல்",
                                                  
                                                  answer:2
                                                  },
                                                  
                                                  {
                                                  question:"வள்ளலார் என போற்றப்படுபவர் யார்?",
                                                  choice1:"பாண்டித்துரை",
                                                  choice2:"பாரி",
                                                  choice3:"இராமலிங்க அடிகள்", 
                                                  choice4:"அதியமான்",
                                                  
                                                  answer:3
                                                  },
                                               
                                                  {
                                                  question:"பொருந்தாத சொல்லை கண்டறிக",
                                                  choice1:"சீட்டுக்கவி",
                                                  choice2:"ஆசுகவி",
                                                  choice3:"மதுரகவி",
                                                  choice4:"விகடகவி",
                                                  
                                                  answer:4
                                                  },
                                                  
                                                  
                                                  {
                                                  question:"பொருந்தாத சொல்லை கண்டறிக", 
                                                  choice1:"அழகு",
                                                  choice2:"தேன்",
                                                  choice3:"இனிப்பு", 
                                                  choice4:"சுவை",
                                                  
                                                  answer:1
                                                  },
                                                  
                                                  
                                                  {
                                                  question:"மரபுப் பிழைகள் அற்ற தொடரைக் குறிப்பிடுக", 
                                                  choice1:"ஆட்டுக்கூட்டம்",
                                                  choice2:"ஆட்டுமந்தை",
                                                  choice3:"ஆட்டுநிரை",
                                                  choice4:"ஆட்டுத்தொழுவம்" ,
                                                  
                                                  answer:2
                                                  },
     
                                                  
     
     {
        question:"புனையா ஓவியம் போல இந்த உவமையால் விளக்கப்பெறும் பொருத்தமான பொருளைத் தேர்ந்தெடுக்கவும்",
        choice1:"தீட்டிய ஓவியம்",
        choice2:"தீட்டப்படாத ஓவியம்",
        choice3:"செதுக்கிய ஓவியம்",
        choice4:"செதுக்கப்படாத ஓவியம்",
        
        answer:2
        },
        
        
        {
        question:"பசுத்தோல் போர்த்திய புலி போல இவ்வுவமையால் விளக்கப்பெறும் பொருத்தமான பொருனைத் தேர்ந்தெடுக்க",
        choice1:"வேட்டை",
        choice2:"வேட்கை",
        choice3:"நயவஞ்சகம்", 
        choice4:"வேண்டாமை", 
        
        answer:3
        },
        
        
        {
        question:"திண்னையை இடித்து தெருவாக்கு என்ற பாடலை இயற்றியவர் யார்?",
        choice1:"பட்டுக்கோட்டை கல்யானசுந்தரம்",
        choice2:"தாராபாரதி",
        choice3:"அழகிய சொக்கநாதப் புலவர்",
        choice4:"உடுமனை நாராயை கவி",
        
        answer:2
        },
        
        {
        question:"செய்யும் தொழிலே தெய்வம் என்ற பாடலை இயற்றியவர் யார்?",
        choice1:"தாராபாரதி",
        choice2:"பட்டுக்கோட்டை கல்யானசுந்தரம்", 
        choice3:"உடுமனை நாராயைகவி",
        choice4:"திரிகூடராசப்பக் கவிராயர்",
        
        answer: 2
        },
        
        {
        question:"திரிகடுகத்தின் ஆசிரியர்",
        choice1:"மதுரை கூடலூர் கிழார்",
        choice2:"நல்லாதனார்",
        choice3:"வமாசிகீனார்",
        choice4:"கடுவெளி சித்தர்", 
        
        answer:2
        },
        
        {
        question:"மெய்ப்பொருள் கல்வி என்ற நூலின் ஆசிரியர் யார்?",
        choice1:"வாணிதாசன்",
        choice2:"கண்னதாசன்",
        choice3:"மருதகாசி",
        choice4:"பாரதிதாசன்", 
        
        answer:1
        },
        
        {
        question:"கீழ்காணும் நூல்களுள் சச்சிதானந்தன் இயற்றிய நூல் எது",
        choice1:"தமிழ்ப்பசி",
        choice2:"சமயப்பொருள் கல்வி",
        choice3:"பொங்கல் வழிபாடு",
        choice4:"உழவின் சிறப்பு",
        
        answer:1
        },
        
        {
        question:"கால்மடித்து இலக்கணகுறிப்பு காண்க",
        choice1:"பண்புத்தொகை",
        choice2:"வினைசயச்சம்",
        choice3:"இரண்டாம் வேற்றுமைத்தொகை",
        choice4:"ஆறாம் வேற்றுமைத்தொகை",
        
        answer: 3
        },
        
        {
        question:"கவையடிக்கேழல் இலக்கணகுறிப்பு காண்க", 
        choice1:"இரண்டாம் வேற்றுமை தொகை",
        choice2:"இரண்டாம் வேற்றுமை உருபும் பயனும் உடன் சோக்க தொகை",
        choice3:"மூன்றாம் வேற்றுமைத்தொகை",
        choice4:"மூன்றாம் வேற்றுமை உருபும் பயனும் உடன் தொக்க தொகை", 
        
        answer:2
        },
        {
        question:"ஈன் குழவி இலக்கணகுறிப்பு தருக",
        choice1:"வினைத்தொகை",
        choice2:"பண்புத்தொகை",
        choice3:"ஈறுகெட்ட எதிர்மறை பெயசரச்சம்",
        choice4:"ஆறாம் வேற்றுமைத்தொகை",
        
        answer: 1
        },
        
        {
        question:"புகுக இலக்கணகுறிப்பு தருக",
        choice1:"இரண்டாம் வேற்றுமைத்தொகை",
        choice2:"வினைசயச்சம்",
        choice3:"வியங்கோள் வினைமுற்று", 
        choice4:"முன்னினை ஒருமை வினைமுற்று",
        
        answer: 3
        },
        
        {
        question:"சீவகனின் வரலாற்றைக் கூறும் சீவகசிந்தாமணியின் ஆசிரியர் யார்?",
        choice1:"கொங்குனார்",
        choice2:"திருத்தக்கதேவர்", 
        choice3:"புத்தமித்திரர்",
        choice4:"நாக குத்தனார்", 
        
        answer:2
        },
        
        
        {
        question:"திராவிட மொழிகளின் ஒப்பிலனக்கனம் என்ற நூலை இயற்றியவர் யார்?",
        choice1:"வீரமாமுனிவர்",
        choice2:"செய்குத்தம்பி பாவலர்", 
        choice3:"டாக்டர் கால்டுவெல்",
        choice4:"ஜி யு போப்",
        
        answer:3
        },
        
        
        {
        question:"இரட்சணிய யாத்திரிகம் என்ற நூலை இயற்றியவர் யார்?",
        choice1:"டாக்டர் கால்டுவெல்",
        choice2:"ஜி யு போப்",
        choice3:"கிருஷ்னபிள்ளை",
        choice4:"உமறுப் புலவர்",
        
        answer:3
        },
        
        
        
        {
        question:"கீழ்காணும் நூல்களுள் பாரதியார் இயற்றிய நூல் அல்லாதது எது?",
        choice1:"கண்னன் பாட்டு",
        choice2:"நவதந்திரக் கதைகள்",
        choice3:"ஞானரதம்",
        choice4:"எதிர்பாராத முத்தம்", 
        
        answer:4
        },
        
        {
        question:"கீழ்க்காணும் நூல்களுள் பாரதிதாசன் இயற்றிய நூல்களுள் அல்லாதது எது?",
        choice1:"வள்ளுவர் உள்ளம்",
        choice2:"இளைஞர் இலக்கியம்", 
        choice3:"காதலா கடமையா",
        choice4:"சுதேச கீதங்கள்",
        
        answer:4
        },
        
        
        {
        question:"கீழ்க்காணும் நூல்களில் மூ.வ இயற்றிய நூல் எது?",
        choice1:"தம்பிக்கு எந்த ஊரு",
        choice2:"கொடிமரத்தின் வேர்கள்", 
        choice3:"காத்திருந்த காற்று",
        choice4:"ஆப்பிள் கனவு",
        
        answer:1
        },
        
        
        {
        question:"அருந்தமிழ் செல்வி என்ற அடைமொழியால் வழங்கப்படும் புலவர் யார்?",
        choice1:"அவ்வையார்",
        choice2:"காரைக்கால் அம்மையார்",
        choice3:"ஆண்டாள்",
        choice4:"நச்செளனையார்", 
        
        answer:1
        },
        {
        question:"திராவிட சிசு என்று அடைபெயரால் வழங்கப்பெறும் புலவர் யார்?",
        choice1:"சீத்தலை சாத்னார்",
        choice2:"நக்கீரனார்",
        choice3:"திருஞானசம்பந்தர்",
        choice4:"நம்மாழ்வார்",
        
        answer:3
        },
     
        {
        question:"சுதானந்த பாரதியாருக்கு வழங்கப்படும் அடைபெயர் என்ன?",
        choice1:"கமகப்பிரியா",
        choice2:"காரை முத்துப் புலவர்", 
        choice3:"கவியோகி",
        choice4:"தமிழ் தென்றல்", 
        
        answer:3
        }                              
                      
     
];


const score_pt = 10;
const max_ques = 10;

startgame = () => {
    score = 0;
    questionCounter = 0;
    availableQuestion = [...questions];

    getNewQuestion()
}

getNewQuestion = () => {
    if(availableQuestion === 0 || questionCounter >= max_ques){
       localStorage.setItem('mostrecentscore',score);
        return window.location.assign('end.html')
    }
    questionCounter++;
    progressText.innerText = `Qusetion ${questionCounter} of ${max_ques}`;

    const questionIndex  = Math.floor(Math.random() * availableQuestion.length);
    currentQuestion = availableQuestion[questionIndex];
    question.innerText = currentQuestion.question;
    

    choices.forEach(choice => {
        const number = choice.dataset['number'];
        choice.innerText = currentQuestion['choice' + number];
    })

    availableQuestion.splice(questionIndex,1);

    acceptingAnswer = true;

}

choices.forEach( choice => {
   choice.addEventListener('click', e => {
      if(!acceptingAnswer) return
   acceptingAnswer = false;

   const selectedChoice = e.target
   const selectedAnswer = selectedChoice.dataset['number']

   let classToApply = selectedAnswer == currentQuestion.answer ? 'correct' : 'incorrect'

   if(selectedAnswer === incorrect){
      alert("The Answer Is " + currentQuestion.answer);
   }
   

   if(classToApply === 'correct'){
      incrementScore(score_pt)
   }
   selectedChoice.parentElement.classList.add(classToApply)
   
   setTimeout(() => {
      selectedChoice.parentElement.classList.remove(classToApply)
      getNewQuestion()
   },1000)
   })
 
})

incrementScore = num => {
   score += num;
   scoreText.innerText = score;
}
startgame()